pos = input().strip()  # รับมามีอย่างน้อย 1 ตัวแน่ ๆ
row = ''
col = ''
if len(pos) <= 3:
    # แบบที่ 1
    row = ???
    col = ???
else:
    # แบบที่ 2 (กรณีนี้ค่อยท าทีหลังก็ได้ เพราะยุ่งกว่า แต่ให้คะแนนแค่ 20%)
    # หาค่าของตัวอักษรแถว มาใส่ในตัวแปร row ถา้หาไม่พบ กใ็ห้เป็นสตริงว่าง ๆ
    # หาค่าของเลขคอลัมน์มาใส่ในตัวแปร col ถ้าหาไม่พบ ก็ให้เป็นสตริงว่าง ๆ
    row = row  # ในกรณีที่ยังไม่ได้เขียนแบบที่2 ก็เขียนค าสั ่งนี้ไว้ก่อน (ไม่งั้น ระบบจะฟ้องว่าหลัง else ไม่มีค าสั ่ง)
row = row.strip()
col = col.strip()
# -----------------------------------------
valid_row = True
valid_col = True
# ตรวจค่าของสตริง row ถ้าผิด ก็เปลี่ยนตวัแปร valid_row ให้เป็น False
# ตรวจค่าของสตริง col ถ้าผิด ก็เปลี่ยนตวัแปร valid_col ให้เป็น False
# -----------------------------------------
# ตรวจค่าของตัวแปร valid_row และ valid_col
# เพื่อแสดงข้อผิดพลาด ถ้ามคี่าเป็น False (มี 3 กรณี)
# ถา้ไม่มีข้อผิดพลาด ก็ค่อยตดั สินใจว่าจะแสดง Black หรือ White ตามสีพื้นของช่อง row, col
