# ฝันหวานอายจูบ โดย STAMP
# ฉันฝันถึงเธอคนที่อยู่ไกลแสนไกล
# ช่างหวานละมุนอบอุ่นข้างในหัวใจ
# แต่อายไม่กล้าแม้จะบอกกับใคร
# จึงจูบผ่านสายลมให้พัดพาไป
# เพราะฝันและจริง
# ยังไม่เคยพบกัน
# เพราะหวานเกินไป
# ไม่ว่าใครก็ต้องใจสั่น
# เพราะอายเหลือเกินกว่าที่จะพูดคำนั้น
# เพราะจูบของเธอยังไม่ใช่จูบของฉัน
# ความรักครั้งนี้จะเป็นอย่างไร
# ฉันควรจะต้องทำใจหรือเปล่า
# จะเป็นได้แค่เพียงฝัน
# ความรักครั้งนี้จะเป็นอย่างไร
# สุขสมได้ดั่งใจหรือเป็นฝันชั่วคราว
# อยู่ที่เธอรู้ไหม
# ชีวิตของฉันเมื่อพบกับเธอนั้น
# จะเปลี่ยนแปลงหรือเป็นเหมือนเก่า
# เป็นแค่ฝันไป
# คือคำถามฝากไว้
# ฉันวอนไห้สายลมพัดลอยผ่านไป
# ถึงเธอ
# ถ้าฝันและจริง
# จะบังเอิญเจอกันสักวัน
# ถ้าหวานข้างใน
# ใจทั้งสองได้พร้อมพร้อมกัน
# ถ้าอายจะหายไปจากประโยคเหล่านั้น
# และถ้าจูบของเธอจะกลายเป็นจูบของฉัน
# ความรักครั้งนี้จะเป็นอย่างไร
# ฉันควรจะต้องทำใจหรือเปล่า
# จะเป็นได้แค่เพียงฝัน
# ความรักครั้งนี้จะเป็นอย่างไร
# สุขสมได้ดั่งใจหรือเป็นฝันชั่วคราว
# อยู่ที่เธอรู้ไหม
# ชีวิตของฉันเมื่อพบกับเธอนั้น
# จะเปลี่ยนแปลงหรือเป็นเหมือนเก่า
# เป็นแค่ฝันไป
# คือคำถามฝากไว้
# ฉันวอนไห้สายลมพัดลอยผ่านไป
# ถึงเธอ
# ฝากทุกข้อความ
# ส่งไปถึงเธอ
# ที่ไม่อาจจะเอ่ย
# ในยามที่พบเจอ
# อาจมีสักวัน
# เธอจะได้รับมัน
# เธอจะได้รู้ว่าฉันนั้นคิดเช่นไร (ฮู้ว)
# ความรักครั้งนี้จะเป็นอย่างไร
# ฉันควรจะต้องทำใจหรือเปล่า
# จะเป็นได้แค่เพียงฝัน
# ความรักครั้งนี้จะเป็นอย่างไร
# สุขสมได้ดั่งใจหรือเป็นฝันชั่วคราว
# อยู่ที่เธอรู้ไหม
# ชีวิตของฉันเมื่อพบกับเธอนั้น
# จะเปลี่ยนแปลงหรือเป็นเหมือนเก่า
# เป็นแค่ฝันไป
# คือคำถามฝากไว้
# ฉันวอนไห้สายลมพัดลอยผ่านไป
# ถึงเธอ


# เราจะข้ามเวลามาพบกัน by ปอย Potrait & ก้อย รัชวิน

# ทุกครั้งที่ฉันร้องไห้จนจมทะเลน้ำตา
# เหว่ว้าและเคว้งคว้างกลางผู้คน
# เจ็บจนไม่อยากหายใจ
# ถูกรักทำร้ายจนเปราะบาง
# ขอบฟ้าความหวังซีดจางเหลือเกิน
# แต่บอกกับใจไม่หยุดฝัน
# อธิษฐานในกาลนิรันดร์
# อย่าหยุดศรัทธา
# สักวันคงได้พบเธอ
# อีกครึ่งหนึ่งของดวงวิญญาณ
# ฉันรออยู่ คนเคยรู้ใจคนเคยรู้จัก
# จำฉันได้ไหม
# เราเคยพลัดพรากกัน
# หากเธอกับฉันสวนทางกัน ในความฝัน
# อยากให้สายตาเราได้จ้องกัน
# และให้เธอบอกฉัน
# ว่าฉันข้ามเวลา เพื่อมาพบเธอ
# ฉันใช้ชีวิตมืดมนดั่งคนที่มีแผลใจ
# แผ่นดินและผืนฟ้ากว้างไกล
# มันกลับไม่เหลือทางให้เดิน
# ทอดทิ้งรักแท้ที่ข้างทาง
# ปล่อยทิ้งความหวังที่พังยับเยิน
# อยากบอกกับใจให้หยุดฝัน
# อธิษฐานในกาลนิรันดร์
# เจ็บกับศรัทธา
# กี่วันก็ไม่พบเจอ (เราจะได้พบกัน)
# อีกครึ่งหนึ่งของดวงวิญญาณ
# ฉันรออยู่ คนเคยรู้ใจคนเคยรู้จัก
# เธอไปอยู่ไหน
# เราคงพลัดพรากกัน
# หากเธอกับฉันสวนทางกัน ในความฝัน
# อยากให้สายตาเราได้จ้องกัน
# โปรดให้เธอบอกฉัน
# ว่าฉันข้ามเวลา เพื่อมาพบเธอ
# หากเธอกับฉันสวนทางกัน ในวันนั้น
# ยามที่สายตาเราได้จ้องกัน
# อยากให้เธอบอกฉัน
# ว่าเราข้ามเวลา เพื่อมาพบกัน

n = int(input())
