# กาลครั้งหนึ่ง by STAMP

# กาลครั้งหนึ่ง การพบใครคนหนึ่งทำให้ฉันสุขใจ
# กาลครั้งหนึ่ง ทุกช่วงเวลาเราเคยมีกันใกล้ ๆ
# แต่กาลครั้งหนึ่ง สุดท้ายไม่จบตรงชั่วนิรันดร์เสมอไป
# กาลครั้งหนึ่ง ชีวิตเลือกเส้นทางให้เรามีอันต้องไกล
# เรื่องราวของฉันเดินต่อไป จากตรงนั้น ไกลสุดไกล
# เหมือนจะไกลจนลืมว่าเคยเกิดสิ่งเหล่านี้
# แต่ในวันที่ฝน ร่วงจากฟ้า วันที่มองหาใครก็ไม่มี
# วินาทีนั้นจะมีบางอย่างที่สำคัญ เกิดในใจฉัน
# กาลครั้งนั้นยังอบอุ่นในใจ
# รู้สึกทุกครั้งว่าเธอยังดูแลฉันใกล้ ๆ
# เหม่อมองฟ้าแล้วถอนหายใจ เหมือนเราได้พูดกัน
# ราวกับเธอนั้นไม่เคยจากไปไหน
# ยังคงยืนส่งยิ้มให้กำลังใจอยู่ในความทรงจำ (ในความทรงจำ)
# หากชีวิตนี้เร็วดั่งความฝัน กาลครั้งหนึ่ง
# ดีใจนะที่เราพบกัน
# เรื่องราวชีวิต เดินต่อไป จากตรงนั้น ไกลสุดไกล
# เหมือนจะไกลจนลืมว่าเคยเกิดสิ่งเหล่านั้น
# แต่ในคืนเหน็บหนาว เกินจะต้านทาน
# คืนที่ความเหงา เข้ามาฉับพลัน
# คืนนั้นจะมีความรู้สึกพิเศษและสำคัญ ปรากฎในใจฉัน
# กาลครั้งนั้นยังอบอุ่นในใจ
# รู้สึกทุกครั้งว่าเธอยังดูแลฉันใกล้ ๆ
# เหม่อมองฟ้าแล้วถอนหายใจ เหมือนเราได้พูดกัน
# ราวกับเธอนั้นไม่เคยจากไป
# ยังคงยืนส่งยิ้มให้กำลังใจอยู่ในความทรงจำ (ในความทรงจำ)
# หากชีวิตนี้เร็วดั่งความฝัน กาลครั้งหนึ่ง
# ดีใจนะที่เราพบกัน
# ฉันจะอยู่ โดยที่รู้ว่าทุกนาทีนั้นแสนพิเศษ
# ฉันจะทำ (ฉันจะทำ) ทุก ๆ สิ่ง (ทุก ๆ สิ่ง)
# ให้เธอภูมิใจเมื่อได้เห็น
# เธออยู่ตรงนั้นสบายดีไหม
# ฉันอยู่ตรงนี้เป็นเหมือนเดิม
# คิดถึงเธอทุกวัน (คิดถึงเธอทุกวัน)
# หากชีวิตนี้เร็วดั่งความฝัน กาลครั้งหนึ่ง
# สักวันเราคงได้พบกัน

n = int(input())
